<a href="https://colab.research.google.com/github/JakeOh/202007_itw_bd18/blob/master/lab_python/python61_datetime.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

* Python datetime 모듈(datetime.py 파일)
  * datetime 클래스: 날짜(date), 시간(time)과 관련된 정보들을 저장, 메서드를 포함.

In [2]:
# import module_name
# module_name.class_name[function_name, variable_name, ...]

# from module_name import class_name[function_name, variable, ...]
# class_name[function_name, ...]

from math import sqrt
sqrt(2)

1.4142135623730951

In [3]:
import datetime  # datetime 모듈을 임포트(메모리 로드)

datetime.datetime.now()  # datetime 모듈의 datetime 클래스의 now() 메서드를 호출

datetime.datetime(2020, 10, 13, 0, 57, 13, 820884)

In [4]:
from datetime import datetime  # datetime 모듈의 datetime 클래스만 임포트(메모리 로드)

datetime.now()  # datetime 클래스의 now() 메서드를 호출.

datetime.datetime(2020, 10, 13, 0, 59, 21, 855196)

In [7]:
# datetime.now(): OS의 시간대(time zone)에서의 현재 시간을 리턴.
now = datetime.now()
print(now)  #> Google Colab 환경에서 설정된 시간대의 현재 날짜/시간 정보를 리턴 -> UTC+00:00
# UTC: Coordinate Universal Timezone
# KST: Korean Standard Timezone, 한국 표준시(UTC+09:00)

2020-10-13 01:11:16.859857

In [8]:
# datetime 생성자 함수(constructor function): 특정 날짜/시간으로 datetime 객체를 생성
date1 = datetime(year=2020, month=10, day=13)
print(date1)

2020-10-13 00:00:00

In [12]:
date2 = datetime(year=2020, month=10, day=14, hour=10, minute=17)
print(date2)

2020-10-14 10:17:00

In [13]:
print(date2 - date1)

1 day, 10:17:00

* datetime(날짜/시간) 객체 <--> str(문자열) 변환
  * `datetime.strptime(문자열, 포맷문자열)`: 문자열을 datetime 객체로 변환(parsing).
  * `datetime.strftime(포맷문자열)`: datetime 객체를 문자열로 변환(formatting)

In [19]:
now = datetime.now()
print(now)
print(now.strftime('%Y/%m/%d'))
print(now.strftime('%y/%m/%d'))
print(now.strftime('%b. %d, %y'))
print(now.strftime('%B %d, %y'))
# %Y: 4자리 연도(year), %y: 2자리 연도
# %m: 2자리 월(month), %b: 월 이름 약자, %B: 월 이름
# %d: 2자리 일(day)

2020-10-13 01:50:17.023345
2020/10/13
20/10/13
Oct. 13, 20
October 13, 20

In [26]:
date3 = datetime(2020, 10, 13, 14, 30, 0)
print(date3)
print(date3.strftime('%H:%M:%S'))
print(date3.strftime('%I:%M:%S %p'))
# %H: 24시간 형식 시간(hour), 00 ~ 23
# %I: 12시간 형식 시간(hour), 1 ~ 12
# %M: 2자리 분(minute), 00 ~ 59
# %S: 2자리 초(second), 00 ~ 59

2020-10-13 14:30:00
14:30:00
02:30:00 PM

In [29]:
print(datetime.strptime('2020-10-13', '%Y-%m-%d'))
print(datetime.strptime('20-10-13', '%y-%m-%d'))
print(datetime.strptime('20-10-13', '%d-%m-%y'))

2020-10-13 00:00:00
2020-10-13 00:00:00
2013-10-20 00:00:00

* timestamp(UNIX time, POSIX time, epoch time, ...):
  1970년 1월 1일 0시 0분 0초를 시작으로 해서 1초마다 1씩 증가하는 숫자.
* `datetime.timestamp()`: datetime 객체 -> timestamp(숫자)
* `datetime.fromtimestamp(숫자)`: timestamp(숫자) -> datetime 객체.

In [36]:
now = datetime.now()
print(now)
print(now.timestamp())
print(datetime.fromtimestamp(1602556762))

2020-10-13 02:40:31.926031
1602556831.926031
2020-10-13 02:39:22

* https://github.com/wesm/pydata-book/tree/2nd-edition/datasets/movielens/
의 데이터 파일 중 ratings.dat 파일을 읽어서 데이터 프레임을 생성.
* 데이터 프레임에 dt 컬럼을 추가 - timestamp 컬럼의 숫자들을 datetime 객체로 변환한 값을 저장.

In [39]:
import pandas as pd

data_file = 'https://github.com/wesm/pydata-book/blob/2nd-edition/datasets/movielens/ratings.dat?raw=true'
ratings = pd.read_csv(data_file,
                      sep='::',
                      header=None,
                      names=['user_id', 'movie_id', 'rating', 'timestamp'])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:7: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  import sys

In [40]:
ratings.head()

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [41]:
print(datetime.fromtimestamp(978300760))

2000-12-31 22:12:40

In [42]:
ratings.tail()

         user_id  movie_id  rating  timestamp
1000204     6040      1091       1  956716541
1000205     6040      1094       5  956704887
1000206     6040       562       5  956704746
1000207     6040      1096       4  956715648
1000208     6040      1097       4  956715569

In [43]:
print(datetime.fromtimestamp(956715569))

2000-04-26 02:19:29

In [47]:
dates = []  # timestamp를 datetime 객체로 변환한 값들을 저장할 리스트
for ts in ratings['timestamp']:  # timestamp 컬럼의 값들을 반복하면서
    dt = datetime.fromtimestamp(ts)  # timestamp(숫자)를 datetime 객체로 변환.
    dates.append(dt)  # 변환된 datetime 객체를 리스트에 추가.

# dates 리스트를 pd.Series로 변환 후, 데이터 프레임의 새로운 컬럼으로 추가.
ratings['dt'] = pd.Series(dates)

In [48]:
ratings.head()

   user_id  movie_id  rating  timestamp                  dt
0        1      1193       5  978300760 2000-12-31 22:12:40
1        1       661       3  978302109 2000-12-31 22:35:09
2        1       914       3  978301968 2000-12-31 22:32:48
3        1      3408       4  978300275 2000-12-31 22:04:35
4        1      2355       5  978824291 2001-01-06 23:38:11

In [46]:
ratings.tail()

         user_id  movie_id  rating  timestamp                  dt
1000204     6040      1091       1  956716541 2000-04-26 02:35:41
1000205     6040      1094       5  956704887 2000-04-25 23:21:27
1000206     6040       562       5  956704746 2000-04-25 23:19:06
1000207     6040      1096       4  956715648 2000-04-26 02:20:48
1000208     6040      1097       4  956715569 2000-04-26 02:19:29